' ====================================================================
' ポケコン電卓
' --------------------------------------------------------------------
' ﾌｧｲﾙ名   : numbers_org.bas
' 開発環境 : PC-1245
' 動作環境 : PC-1245/50/51/55
'            ※要PC-インタープリタ
' 著作権   : Kenoh
' 作成者   : Kenoh
' 作成日   : 2026/02/28
' 更新日   : 2026/03/05
' Version  : 0.26.3.05
' ====================================================================

' ====================================================================
' 初期設定
' ====================================================================
' ※CLEARを実行すると、データが消去されるため、使わないこと！
' （プログラム実行時以外も同様）
1 G=00:M=06:T=00:U=00:Z=03: GOTO 20
' ====================================================================
' サブルーチン
' ====================================================================
' ドットキャラクター表示
10 A=W+00:B=W+01:C=W+02:D=W+03:E=W+04: DEG L,A),B),C),D),E): GOTO R
' 敵撃退
11 IF G<FF G=G+01
13 IF T>63 U=U+01:T=T-64
15 FOR 01: BEEP B,0F: NEXT: L=X-55*05+0A:W=4B: GOTO 10
' ====================================================================
' メイン処理
' ====================================================================
' ステージ開始時の初期設定
20 COS: X=55: FOR M+01:X)=0C:X=X+01: NEXT
' 自機を表示
25 L=00:W=00:R=27: GOTO 10
' 自機残機を表示
27 L=05:W=Z*05:R=30: GOTO 10
' --------------------------------------------------------------------
' メインループ開始
' --------------------------------------------------------------------
' 一定のカウンタに達したら、敵を表示及び画面表示（左スクロール）
30 IF S<03 GOTO 40
' 得点に応じて、表示桁数を減らす（最小２桁）
35 B=M:W=G/1E: IF W>04 W=04
' 右端へ新たな敵を出現し、各桁に入る敵の番号を格納し、画面表示（左スクロール）
36 M=06-W: IF B>M W=55+B-01:W=W) NOT W= RND 0B
37 X=55+M:X)=W:X=55: FOR M: W=X+01:X)=W):L=X-55*05+0A:W=X)*05+14:R=39: GOTO 10
39 X=X+01: NEXT :S=00
' --------------------------------------------------------------------
' キー判定
' --------------------------------------------------------------------
' 撃退判定
' キー入力が無い場合、判定しない
40 IF INKEY$=FF GOTO 79 NOT X=55: FOR M
' 空白はスキップ
42 IF X)=0C GOTO 49
' 数字ベーダーは、数字で撃退
45 IF INKEY$ =X)+40 T=T+X-54:X)=0C:B=20:R=79: GOTO 11
' 数字ベーダー UFOは、ENTERで撃退
46 IF X)=0A IF INKEY$ =00 T=T+64:X)=0C:B=1B:R=79: GOTO 11
' １番左に敵がいなければ、撃退できずループ終了
47 GOTO 79
49 X=X+01: NEXT
' 左端に敵がいなければ、メインループ開始に戻る
79 X=55: IF X)=0C S=S+01: GOTO 30
' --------------------------------------------------------------------
' ミス処理
' --------------------------------------------------------------------
' 左端まで侵略されたらミス
' ミス時のメロディ（※PC-1245/50では容量が足りないため、入れられない）
'80 BEEP 00,FF:BEEP 04,FF
'81 IF Z<04 BEEP 07,FF
'82 IF Z<03 BEEP 09,FF
'83 IF Z<02 BEEP 12,FF:BEEP 09,FF:BEEP 00,FF
85 FOR 19: SQR : BEEP 7F,02: NEXT : STOP :Z=Z-01: IF Z>00 GOTO 20
' --------------------------------------------------------------------
' ゲームオーバー
' --------------------------------------------------------------------
' ゲームオーバーの表示（※PC-1245/50では容量が足りないため、入れられない）
'90 COS: CALL 01: PRNT "GAME OVER": STOP
' ====================================================================
' 内蔵BASICインタープリタ側
' ====================================================================
' 変数の格納領域
' 変数A〜Z  $C686〜$C69F
' 配列      $C600〜$C69F　※変数A〜Zは、上記の領域に格納されている
900 "=" CALL &C300: PRINT "SCORE "; STR$ ( PEEK &C69A*100+ PEEK &C699)
